# Задача 34: Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм. Поскольку
# разобраться в его кричалках не настолько просто, насколько легко он их придумывает, Вам
# стоит написать программу. Винни-Пух считает, что ритм есть, если число слогов (т.е. число
# гласных букв) в каждой фразе стихотворения одинаковое. Фраза может состоять из одного
# слова, если во фразе несколько слов, то они разделяются дефисами. Фразы отделяются друг
# от друга пробелами. Стихотворение Винни-Пух вбивает в программу с клавиатуры. В ответе
# напишите “Парам пам-пам”, если с ритмом все в порядке и “Пам парам”, если с ритмом все не
# в порядке
# Ввод: Вывод:
#    Парам пам-пам

def rhythm(a ='папа-ра-рам',b ='рам-пам-папам',c ='па-ра-па-пам'):
   return a,b,c

a, b, c = rhythm()
count = 0
vowels = set("аеёиоуыэюя")
for letter in a:
    if letter in vowels:
                count += 1
x = count
count = 0
for letter in b:
    if letter in vowels:
                count += 1
y = count
count = 0
for letter in c:
     if letter in vowels:
                count += 1
z = count
if x == y == z:
   
    print('Парам пам-пам')
else:
    print('Пам парам')      


